import random, keyboard

print("안녕하세요!")
print("저는 이곳을 할리갈리 게임 속 세상이에요.")


def hg():

    #사람_숫자=int(input("게임 인원을 정해주세요.2~4"))
    #바나나,사과,딸기,포도 숫자:1~5

    cards = ['바나나1','바나나2','바나나3','바나나4','바나나5','사과1','사과2','사과3','사과4','사과5','딸기1','딸기2','딸기3','딸기4','딸기5','포도1','포도2','포도3','포도4','포도5'] *3


    random.shuffle(cards)

    나눠줌= cards[: 21]
    안_나눠줌=cards[21:]

    a = 나눠줌[:7]
    b = 나눠줌[7:15]
    c = 나눠줌[15:]
    while True:
        pass



while True:
    print("1. 게임속으로 들어간다. 2. 아직은..."  )

    할리갈리=input()

    if 할리갈리=='1' or 할리갈리=='1. 게임속으로 들어간다.' or 할리갈리=='게임속으로 들어간다.':
        hg()
    elif 할리갈리=='2' or 할리갈리=='2. 아직은...' or 할리갈리=='아직은...':
        print("나가 임마")
        break
    else :
        print("다시 입력하세요.")
